app/controllers/admin/posts_controller.rb

	def index
		@posts = Post.all.recent.includes(:author, :group) #group scope
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" IN (7, 6, 5, 4, 3, 2, 1)
SELECT "posts".* FROM "posts"  ORDER BY updated_at DESC