app/views/groups/show.html.erb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
---
			<% if current_user && post.editable_by?(current_user) %>
				<td><%= link_to('Edit', edit_group_post_path(post.group, post), :class => "btn btn-mini") %></td>