app/controllers/groups_controller.rb

  def index
    @groups = Group.all.includes(:owner)
---
SELECT "groups".* FROM "groups"

  def show
  	@group = Group.find(params[:id])
  	@posts = @group.posts.includes(:author)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 1]]

  def edit
  	@group = current_user.groups.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = ? AND "groups"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]

  def update
  	@group = current_user.groups.find(params[:id])

    respond_to do |format|
      if @group.update(group_params)
---
SELECT  "groups".* FROM "groups" WHERE "groups"."user_id" = ? AND "groups"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
UPDATE "groups" SET "description" = ?, "image" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["description", "這是用種子建立的第1個討論版\r\n\r\n這是用種子建立的第1個討論版"], ["image", "IMG_1119.jpg"], ["updated_at", "2016-06-28 05:52:44.451728"], ["id", 1]]